questions_by_category = {
    "Столицы": [
        {"text": "Столица России?", "options": ["Москва", "Санкт-Петербург", "Воронеж"], "correct_options": "Москва"},
        {"text": "Столица США?", "options": ["Лос-Анджелес", "Нью-Йорк", "Вашингтон"], "correct_options": "Вашингтон"},
        {"text": "Столица Мадагаскара?", "options": ["Антананариву", "Туамасина", "Тулевар"], "correct_options": "Антананариву"},
        {"text": "Столица Турции?", "options": ["Стамбул", "Кипр", "Анкара"], "correct_options": "Анкара"},
        {"text": "Столица Франции?", "options": ["Париж", "Марсель", "Ницца"], "correct_options": "Париж"},
        {"text": "Столица Бразилии?", "options": ["Рио-де-Жанейро", "Сальвадор", "Бразилиа"], "correct_options": "Бразилиа"},
        {"text": "Столица ОАЭ?", "options": ["Дубай", "Эль-Фуджайра", "Абу-Даби"], "correct_options": "Абу-Даби"},
    ],
    "Автомобили": [
        {"text": "Какая марка автомобиля выпускает модель Camry?", "options": ["Toyota", "Honda", "Nissan"], "correct_options": "Toyota"},
        {"text": "Какой автомобиль считается самым продаваемым в мире?", "options": ["Toyota Corolla", "Volkswagen Golf", "Ford F-Series"], "correct_options": "Toyota Corolla"},
        {"text": "Какой из перечисленных автопроизводителей штаб-квартирован в Германии?", "options": ["Toyota", "Ford", "BMW"], "correct_options": "BMW"},
        {"text": "Какой автомобиль получил звание 'Автомобиль года в мире' в 2020 году?", "options": ["Tesla Model 3", "Kia Telluride", "Chevrolet Corvette"], "correct_options": "Kia Telluride"},
        {"text": "Какая компания выпускает модель автомобиля с названием Mustang?", "options": ["Ford", "Chevrolet", "Dodge"], "correct_options": "Ford"},
        {"text": "Какой автомобиль стал самым продаваемым электрическим автомобилем в мире?", "options": ["Tesla Model S", "Nissan Leaf", "Chevrolet Bolt"], "correct_options": "Nissan Leaf"},
        {"text": "Какая страна является родиной автомобильной марки Hyundai?", "options": ["Япония", "Южная Корея", "Китай"], "correct_options": "Южная Корея"},
    ],
    "Животные": [
        {"text": "Какое животное известно своей черно-белой окраской?", "options": ["Тигр", "Леопард", "Панда"], "correct_options": "Панда"},
        {"text": "Какое животное является символом Австралии и обладает сумкой?", "options": ["Кенгуру", "Коала", "Вомбат"], "correct_options": "Кенгуру"},
        {"text": "Как называется самое быстрое животное на Земле?", "options": ["Гепард", "Леопард", "Скорпион"], "correct_options": "Гепард"},
        {"text": "Какое животное является крупнейшим хищником на Земле?", "options": ["Лев", "Тигр", "Косатка"], "correct_options": "Косатка"},
        {"text": "Какой вид животных представляют собой пингвины?", "options": ["Плотоядные", "Травоядные", "Пресмыкающиеся"], "correct_options": "Плотоядные"},
        {"text": "Как называется самая большая примат-обезьяна?", "options": ["Горилла", "Шимпанзе", "Орангутан"], "correct_options": "Горилла"},
        {"text": "Сколько ног у уссурийского тигра?", "options": ["2", "4", "6"], "correct_options": "4"},
    ]
}